esp-cpp/esp-box-emu/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_BOOTLOADER_FLASH_DC_AWARE=y
CONFIG_SPI_FLASH_UNDER_HIGH_FREQ=y                                                                                    ....
CONFIG_SPI_FLASH_HPM_ENA=y

# CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# disable interrupt watchdog
CONFIG_ESP_INT_WDT=n
CONFIG_ESP_TASK_WDT_EN=n

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
# over twice as fast as DIO
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
# CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y

CONFIG_FREERTOS_HZ=1000

CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y

# CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# Common ESP-related
#
# CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=30000
CONFIG_ESP_TIMER_TASK_STACK_SIZE=10240

# Instruction cache: 32KB (default 16KB). The m68k/Z80 interpreters and VDP code
# are large and thrash a 16KB I-cache; with code/rodata mapped through PSRAM
# (SPIRAM_FETCH_INSTRUCTIONS/RODATA below) every miss is a PSRAM round-trip.
# Doubling the I-cache helps all subsystems. Costs ~16KB of internal SRAM.
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# SPIRAM Configuration
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_120M=y
CONFIG_SPIRAM_SPEED=120
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
# Read-only data stays in flash: copying it into PSRAM too costs ~1.5MB, which
# leaves the 8MB boxes with almost no PSRAM heap once the 4MB ROM block is taken.
# CONFIG_SPIRAM_RODATA is not set
# anything larger than this is attempted to allocate within SPIRAM first
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
# specifcally reserved internally for DMA
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=262144
# Dark Forces (TFE) keeps ~750KB of renderer/audio state in .bss; allow it to live in PSRAM.
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

#
# FATFS config
# Support long file names using buffer in heap
CONFIG_FATFS_LFN_HEAP=y
# increase speed of buffered reads
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=16384
# increase speed of seeking for read-mode files
CONFIG_FATFS_USE_FASTSEEK=y

#
# USB config
#
CONFIG_TINYUSB_MSC_ENABLED=y

# ESP32-specific
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

CONFIG_HEAP_PLACE_FUNCTION_INTO_FLASH=y

#
# LVGL configuration - # Monitoring
#
# CONFIG_LV_USE_PERF_MONITOR=y
# CONFIG_LV_USE_MEM_MONITOR=y

CONFIG_LV_BUILD_EXAMPLES=n

# LVGL memory lives in PSRAM (components/box-emu/src/lvgl_mem.c) instead of a
# fixed pool in internal RAM: the GUI (with all of its rom entries) and the
# emulator menu share one LVGL instance, and a fixed 50KB pool ran out in the
# pause menu (LVGL then halts).
CONFIG_LV_USE_CUSTOM_MALLOC=y

CONFIG_LV_DEF_REFR_PERIOD=16

#
# LVGL configuration - # Themes
#
CONFIG_LV_USE_THEME_DEFAULT=y
CONFIG_LV_THEME_DEFAULT_DARK=y
CONFIG_LV_THEME_DEFAULT_GROW=y
CONFIG_LV_THEME_DEFAULT_TRANSITION_TIME=30

CONFIG_I2S_ISR_IRAM_SAFE=y
CONFIG_I2C_ISR_IRAM_SAFE=y
CONFIG_GDMA_CTRL_FUNC_IN_IRAM=y
CONFIG_GDMA_ISR_IRAM_SAFE=y
CONFIG_ESP_IPC_USES_CALLERS_PRIORITY=n

CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y

CONFIG_SPI_FLASH_ROM_IMPL=y
